
## :x: Apply Result

[CI link](https://github.com/rindrics-sandbox-org/terraform-operations/actions/runs/11921472932)

@ Please check the error.

It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
20:52:09.371 INFO   The stack at . will be processed in the following order for command init:
Group 1
- Module .


20:52:09.606 STDOUT terraform: Initializing the backend...
20:52:09.631 STDOUT terraform: Initializing modules...
20:52:09.634 STDOUT terraform: Initializing provider plugins...
20:52:09.634 STDOUT terraform: - Reusing previous version of integrations/github from the dependency lock file
20:52:09.687 STDOUT terraform: - Reusing previous version of hashicorp/null from the dependency lock file
20:52:09.726 STDOUT terraform: - Using previously-installed integrations/github v6.3.1
20:52:09.736 STDOUT terraform: - Using previously-installed hashicorp/null v3.2.3
20:52:09.737 STDOUT terraform: Terraform has been successfully initialized!
20:52:09.737 STDOUT terraform: 
20:52:09.737 STDOUT terraform: You may now begin working with Terraform. Try running "terraform plan" to see
20:52:09.737 STDOUT terraform: any changes that are required for your infrastructure. All Terraform commands
20:52:09.737 STDOUT terraform: should now work.
20:52:09.737 STDOUT terraform: If you ever set or change modules or backend configuration for Terraform,
20:52:09.737 STDOUT terraform: rerun this command to reinitialize your working directory. If you forget, other
20:52:09.737 STDOUT terraform: commands will detect it and remind you to do so if necessary.
1063347
57353172
20:52:09.789 INFO   The stack at . will be processed in the following order for command validate:
Group 1
- Module .


20:52:10.248 STDOUT terraform: Success! The configuration is valid.
20:52:10.248 STDOUT terraform: 
20:52:10.309 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module .


20:52:11.060 STDOUT terraform: github_repository.terraform_operations: Preparing import... [id=github-terraform-examples]
20:52:11.060 STDOUT terraform: github_repository.terraform_state_files: Preparing import... [id=terraform-state-files]
20:52:11.061 STDOUT terraform: github_repository.terraform_state_files: Refreshing state... [id=terraform-state-files]
20:52:11.064 STDOUT terraform: github_repository.terraform_operations: Refreshing state... [id=github-terraform-examples]
20:52:11.064 STDOUT terraform: module.security.data.github_user.this["Rindrics"]: Reading...
20:52:11.967 STDOUT terraform: module.security.data.github_user.this["Rindrics"]: Read complete after 1s [id=14845847]
20:52:11.969 STDOUT terraform: github_membership.org_owner["Rindrics"]: Preparing import... [id=rindrics-sandbox-org:Rindrics]
20:52:11.970 STDOUT terraform: github_membership.org_owner["Rindrics"]: Refreshing state... [id=rindrics-sandbox-org:Rindrics]
20:52:12.342 STDOUT terraform: Terraform used the selected providers to generate the following execution
20:52:12.342 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
20:52:12.342 STDOUT terraform:   + create
20:52:12.342 STDOUT terraform:   ~ update in-place
20:52:12.342 STDOUT terraform: Terraform will perform the following actions:
20:52:12.342 STDOUT terraform:   # github_membership.org_owner["Rindrics"] will be imported
20:52:12.342 STDOUT terraform:     resource "github_membership" "org_owner" {
20:52:12.342 STDOUT terraform:         etag     = "W/\"302392d466113ba2361c57fc6541feb7e1ca1a886a4f171d08515d9ca14f7048\""
20:52:12.342 STDOUT terraform:         id       = "rindrics-sandbox-org:Rindrics"
20:52:12.342 STDOUT terraform:         role     = "admin"
20:52:12.342 STDOUT terraform:         username = "Rindrics"
20:52:12.342 STDOUT terraform:     }
20:52:12.342 STDOUT terraform:   # github_repository.all_in_one["bar"] will be created
20:52:12.342 STDOUT terraform:   + resource "github_repository" "all_in_one" {
20:52:12.343 STDOUT terraform:       + allow_auto_merge            = false
20:52:12.343 STDOUT terraform:       + allow_merge_commit          = true
20:52:12.343 STDOUT terraform:       + allow_rebase_merge          = true
20:52:12.343 STDOUT terraform:       + allow_squash_merge          = true
20:52:12.343 STDOUT terraform:       + archived                    = false
20:52:12.343 STDOUT terraform:       + default_branch              = (known after apply)
20:52:12.343 STDOUT terraform:       + delete_branch_on_merge      = false
20:52:12.343 STDOUT terraform:       + etag                        = (known after apply)
20:52:12.343 STDOUT terraform:       + full_name                   = (known after apply)
20:52:12.343 STDOUT terraform:       + git_clone_url               = (known after apply)
20:52:12.343 STDOUT terraform:       + html_url                    = (known after apply)
20:52:12.343 STDOUT terraform:       + http_clone_url              = (known after apply)
20:52:12.343 STDOUT terraform:       + id                          = (known after apply)
20:52:12.343 STDOUT terraform:       + merge_commit_message        = "PR_TITLE"
20:52:12.343 STDOUT terraform:       + merge_commit_title          = "MERGE_MESSAGE"
20:52:12.343 STDOUT terraform:       + name                        = "bar"
20:52:12.343 STDOUT terraform:       + node_id                     = (known after apply)
20:52:12.343 STDOUT terraform:       + primary_language            = (known after apply)
20:52:12.343 STDOUT terraform:       + private                     = (known after apply)
20:52:12.343 STDOUT terraform:       + repo_id                     = (known after apply)
20:52:12.343 STDOUT terraform:       + squash_merge_commit_message = "COMMIT_MESSAGES"
20:52:12.343 STDOUT terraform:       + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
20:52:12.343 STDOUT terraform:       + ssh_clone_url               = (known after apply)
20:52:12.343 STDOUT terraform:       + svn_url                     = (known after apply)
20:52:12.343 STDOUT terraform:       + topics                      = (known after apply)
20:52:12.343 STDOUT terraform:       + visibility                  = "public"
20:52:12.343 STDOUT terraform:       + web_commit_signoff_required = false
20:52:12.343 STDOUT terraform:       + security_and_analysis (known after apply)
20:52:12.343 STDOUT terraform:     }
20:52:12.343 STDOUT terraform:   # github_repository.all_in_one["baz"] will be created
20:52:12.343 STDOUT terraform:   + resource "github_repository" "all_in_one" {
20:52:12.344 STDOUT terraform:       + allow_auto_merge            = false
20:52:12.344 STDOUT terraform:       + allow_merge_commit          = true
20:52:12.344 STDOUT terraform:       + allow_rebase_merge          = true
20:52:12.344 STDOUT terraform:       + allow_squash_merge          = true
20:52:12.344 STDOUT terraform:       + archived                    = false
20:52:12.344 STDOUT terraform:       + default_branch              = (known after apply)
20:52:12.344 STDOUT terraform:       + delete_branch_on_merge      = false
20:52:12.344 STDOUT terraform:       + etag                        = (known after apply)
20:52:12.344 STDOUT terraform:       + full_name                   = (known after apply)
20:52:12.344 STDOUT terraform:       + git_clone_url               = (known after apply)
20:52:12.344 STDOUT terraform:       + html_url                    = (known after apply)
20:52:12.344 STDOUT terraform:       + http_clone_url              = (known after apply)
20:52:12.344 STDOUT terraform:       + id                          = (known after apply)
20:52:12.344 STDOUT terraform:       + merge_commit_message        = "PR_TITLE"
20:52:12.344 STDOUT terraform:       + merge_commit_title          = "MERGE_MESSAGE"
20:52:12.344 STDOUT terraform:       + name                        = "baz"
20:52:12.344 STDOUT terraform:       + node_id                     = (known after apply)
20:52:12.344 STDOUT terraform:       + primary_language            = (known after apply)
20:52:12.344 STDOUT terraform:       + private                     = (known after apply)
20:52:12.344 STDOUT terraform:       + repo_id                     = (known after apply)
20:52:12.344 STDOUT terraform:       + squash_merge_commit_message = "COMMIT_MESSAGES"
20:52:12.344 STDOUT terraform:       + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
20:52:12.344 STDOUT terraform:       + ssh_clone_url               = (known after apply)
20:52:12.344 STDOUT terraform:       + svn_url                     = (known after apply)
20:52:12.344 STDOUT terraform:       + topics                      = (known after apply)
20:52:12.344 STDOUT terraform:       + visibility                  = "public"
20:52:12.344 STDOUT terraform:       + web_commit_signoff_required = false
20:52:12.344 STDOUT terraform:       + security_and_analysis (known after apply)
20:52:12.344 STDOUT terraform:     }
20:52:12.344 STDOUT terraform:   # github_repository.all_in_one["foo"] will be created
20:52:12.345 STDOUT terraform:   + resource "github_repository" "all_in_one" {
20:52:12.345 STDOUT terraform:       + allow_auto_merge            = false
20:52:12.345 STDOUT terraform:       + allow_merge_commit          = true
20:52:12.345 STDOUT terraform:       + allow_rebase_merge          = true
20:52:12.345 STDOUT terraform:       + allow_squash_merge          = true
20:52:12.345 STDOUT terraform:       + archived                    = false
20:52:12.345 STDOUT terraform:       + default_branch              = (known after apply)
20:52:12.345 STDOUT terraform:       + delete_branch_on_merge      = false
20:52:12.345 STDOUT terraform:       + etag                        = (known after apply)
20:52:12.345 STDOUT terraform:       + full_name                   = (known after apply)
20:52:12.345 STDOUT terraform:       + git_clone_url               = (known after apply)
20:52:12.345 STDOUT terraform:       + html_url                    = (known after apply)
20:52:12.345 STDOUT terraform:       + http_clone_url              = (known after apply)
20:52:12.345 STDOUT terraform:       + id                          = (known after apply)
20:52:12.345 STDOUT terraform:       + merge_commit_message        = "PR_TITLE"
20:52:12.345 STDOUT terraform:       + merge_commit_title          = "MERGE_MESSAGE"
20:52:12.345 STDOUT terraform:       + name                        = "foo"
20:52:12.345 STDOUT terraform:       + node_id                     = (known after apply)
20:52:12.345 STDOUT terraform:       + primary_language            = (known after apply)
20:52:12.345 STDOUT terraform:       + private                     = (known after apply)
20:52:12.345 STDOUT terraform:       + repo_id                     = (known after apply)
20:52:12.345 STDOUT terraform:       + squash_merge_commit_message = "COMMIT_MESSAGES"
20:52:12.345 STDOUT terraform:       + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
20:52:12.346 STDOUT terraform:       + ssh_clone_url               = (known after apply)
20:52:12.347 STDOUT terraform:       + svn_url                     = (known after apply)
20:52:12.347 STDOUT terraform:       + topics                      = (known after apply)
20:52:12.347 STDOUT terraform:       + visibility                  = "public"
20:52:12.347 STDOUT terraform:       + web_commit_signoff_required = false
20:52:12.347 STDOUT terraform:       + security_and_analysis (known after apply)
20:52:12.347 STDOUT terraform:     }
20:52:12.347 STDOUT terraform:   # github_repository.terraform_operations will be updated in-place
20:52:12.347 STDOUT terraform:   # (imported from "github-terraform-examples")
20:52:12.347 STDOUT terraform:   ~ resource "github_repository" "terraform_operations" {
20:52:12.347 STDOUT terraform:         allow_auto_merge            = false
20:52:12.347 STDOUT terraform:         allow_merge_commit          = true
20:52:12.347 STDOUT terraform:         allow_rebase_merge          = true
20:52:12.347 STDOUT terraform:         allow_squash_merge          = true
20:52:12.348 STDOUT terraform:         allow_update_branch         = false
20:52:12.348 STDOUT terraform:         archived                    = false
20:52:12.348 STDOUT terraform:         auto_init                   = false
20:52:12.348 STDOUT terraform:         default_branch              = "main"
20:52:12.348 STDOUT terraform:         delete_branch_on_merge      = true
20:52:12.348 STDOUT terraform:         description                 = "Organization 配下のリソースを管理する Terraform ソースの置き場所"
20:52:12.348 STDOUT terraform:         etag                        = "W/\"45ae5984f09b0344e525b16d802e810396c3d320336b13f0258d40b581505a43\""
20:52:12.348 STDOUT terraform:       ~ full_name                   = "rindrics-sandbox-org/terraform-operations" -> (known after apply)
20:52:12.348 STDOUT terraform:         git_clone_url               = "git://github.com/rindrics-sandbox-org/terraform-operations.git"
20:52:12.348 STDOUT terraform:         has_discussions             = false
20:52:12.348 STDOUT terraform:         has_downloads               = false
20:52:12.348 STDOUT terraform:         has_issues                  = true
20:52:12.348 STDOUT terraform:         has_projects                = false
20:52:12.348 STDOUT terraform:         has_wiki                    = false
20:52:12.348 STDOUT terraform:         homepage_url                = null
20:52:12.348 STDOUT terraform:         html_url                    = "https://github.com/rindrics-sandbox-org/terraform-operations"
20:52:12.349 STDOUT terraform:         http_clone_url              = "https://github.com/rindrics-sandbox-org/terraform-operations.git"
20:52:12.349 STDOUT terraform:         id                          = "github-terraform-examples"
20:52:12.349 STDOUT terraform:         is_template                 = false
20:52:12.349 STDOUT terraform:         merge_commit_message        = "PR_TITLE"
20:52:12.349 STDOUT terraform:         merge_commit_title          = "MERGE_MESSAGE"
20:52:12.349 STDOUT terraform:       ~ name                        = "github-terraform-examples" -> "terraform-operations"
20:52:12.349 STDOUT terraform:         node_id                     = "R_kgDONRuOGQ"
20:52:12.349 STDOUT terraform:         primary_language            = "HCL"
20:52:12.349 STDOUT terraform:         private                     = false
20:52:12.349 STDOUT terraform:         repo_id                     = 890998297
20:52:12.349 STDOUT terraform:         squash_merge_commit_message = "COMMIT_MESSAGES"
20:52:12.349 STDOUT terraform:         squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
20:52:12.349 STDOUT terraform:         ssh_clone_url               = "git@github.com:rindrics-sandbox-org/terraform-operations.git"
20:52:12.349 STDOUT terraform:         svn_url                     = "https://github.com/rindrics-sandbox-org/terraform-operations"
20:52:12.349 STDOUT terraform:         topics                      = []
20:52:12.349 STDOUT terraform:         visibility                  = "public"
20:52:12.349 STDOUT terraform:         vulnerability_alerts        = true
20:52:12.349 STDOUT terraform:         web_commit_signoff_required = false
20:52:12.349 STDOUT terraform:         security_and_analysis {
20:52:12.349 STDOUT terraform:             secret_scanning {
20:52:12.350 STDOUT terraform:                 status = "disabled"
20:52:12.350 STDOUT terraform:             }
20:52:12.350 STDOUT terraform:             secret_scanning_push_protection {
20:52:12.350 STDOUT terraform:                 status = "disabled"
20:52:12.350 STDOUT terraform:             }
20:52:12.350 STDOUT terraform:         }
20:52:12.350 STDOUT terraform:     }
20:52:12.350 STDOUT terraform:   # github_repository.terraform_state_files will be imported
20:52:12.350 STDOUT terraform:     resource "github_repository" "terraform_state_files" {
20:52:12.350 STDOUT terraform:         allow_auto_merge            = false
20:52:12.350 STDOUT terraform:         allow_merge_commit          = true
20:52:12.350 STDOUT terraform:         allow_rebase_merge          = true
20:52:12.350 STDOUT terraform:         allow_squash_merge          = true
20:52:12.350 STDOUT terraform:         allow_update_branch         = false
20:52:12.350 STDOUT terraform:         archived                    = false
20:52:12.350 STDOUT terraform:         auto_init                   = false
20:52:12.350 STDOUT terraform:         default_branch              = "main"
20:52:12.350 STDOUT terraform:         delete_branch_on_merge      = false
20:52:12.350 STDOUT terraform:         description                 = "リポジトリ `github-operations` の GitHub Actions から利用される Terraform state file を保管する"
20:52:12.350 STDOUT terraform:         etag                        = "W/\"e94391674990e4fd99747d9a203df6fcc9e05d60a1f1ae18b95ed497522a4450\""
20:52:12.350 STDOUT terraform:         full_name                   = "rindrics-sandbox-org/terraform-state-files"
20:52:12.350 STDOUT terraform:         git_clone_url               = "git://github.com/rindrics-sandbox-org/terraform-state-files.git"
20:52:12.351 STDOUT terraform:         has_discussions             = false
20:52:12.351 STDOUT terraform:         has_downloads               = false
20:52:12.351 STDOUT terraform:         has_issues                  = false
20:52:12.351 STDOUT terraform:         has_projects                = false
20:52:12.351 STDOUT terraform:         has_wiki                    = false
20:52:12.351 STDOUT terraform:         homepage_url                = null
20:52:12.351 STDOUT terraform:         html_url                    = "https://github.com/rindrics-sandbox-org/terraform-state-files"
20:52:12.351 STDOUT terraform:         http_clone_url              = "https://github.com/rindrics-sandbox-org/terraform-state-files.git"
20:52:12.351 STDOUT terraform:         id                          = "terraform-state-files"
20:52:12.351 STDOUT terraform:         is_template                 = false
20:52:12.351 STDOUT terraform:         merge_commit_message        = "PR_TITLE"
20:52:12.351 STDOUT terraform:         merge_commit_title          = "MERGE_MESSAGE"
20:52:12.351 STDOUT terraform:         name                        = "terraform-state-files"
20:52:12.351 STDOUT terraform:         node_id                     = "R_kgDONRu-jA"
20:52:12.351 STDOUT terraform:         primary_language            = "HCL"
20:52:12.351 STDOUT terraform:         private                     = true
20:52:12.351 STDOUT terraform:         repo_id                     = 891010700
20:52:12.351 STDOUT terraform:         squash_merge_commit_message = "COMMIT_MESSAGES"
20:52:12.351 STDOUT terraform:         squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
20:52:12.352 STDOUT terraform:         ssh_clone_url               = "git@github.com:rindrics-sandbox-org/terraform-state-files.git"
20:52:12.352 STDOUT terraform:         svn_url                     = "https://github.com/rindrics-sandbox-org/terraform-state-files"
20:52:12.352 STDOUT terraform:         topics                      = []
20:52:12.352 STDOUT terraform:         visibility                  = "private"
20:52:12.352 STDOUT terraform:         vulnerability_alerts        = true
20:52:12.352 STDOUT terraform:         web_commit_signoff_required = false
20:52:12.352 STDOUT terraform:     }
20:52:12.352 STDOUT terraform:   # github_team.all_in_one["team-1"] will be created
20:52:12.352 STDOUT terraform:   + resource "github_team" "all_in_one" {
20:52:12.352 STDOUT terraform:       + create_default_maintainer = false
20:52:12.352 STDOUT terraform:       + etag                      = (known after apply)
20:52:12.352 STDOUT terraform:       + id                        = (known after apply)
20:52:12.352 STDOUT terraform:       + members_count             = (known after apply)
20:52:12.353 STDOUT terraform:       + name                      = "team-1"
20:52:12.353 STDOUT terraform:       + node_id                   = (known after apply)
20:52:12.353 STDOUT terraform:       + parent_team_read_id       = (known after apply)
20:52:12.353 STDOUT terraform:       + parent_team_read_slug     = (known after apply)
20:52:12.353 STDOUT terraform:       + privacy                   = "closed"
20:52:12.353 STDOUT terraform:       + slug                      = (known after apply)
20:52:12.353 STDOUT terraform:     }
20:52:12.353 STDOUT terraform:   # github_team.all_in_one["team-2"] will be created
20:52:12.353 STDOUT terraform:   + resource "github_team" "all_in_one" {
20:52:12.353 STDOUT terraform:       + create_default_maintainer = false
20:52:12.353 STDOUT terraform:       + etag                      = (known after apply)
20:52:12.353 STDOUT terraform:       + id                        = (known after apply)
20:52:12.353 STDOUT terraform:       + members_count             = (known after apply)
20:52:12.353 STDOUT terraform:       + name                      = "team-2"
20:52:12.353 STDOUT terraform:       + node_id                   = (known after apply)
20:52:12.353 STDOUT terraform:       + parent_team_read_id       = (known after apply)
20:52:12.353 STDOUT terraform:       + parent_team_read_slug     = (known after apply)
20:52:12.353 STDOUT terraform:       + privacy                   = "closed"
20:52:12.353 STDOUT terraform:       + slug                      = (known after apply)
20:52:12.353 STDOUT terraform:     }
20:52:12.353 STDOUT terraform:   # github_team.all_in_one["team-3"] will be created
20:52:12.353 STDOUT terraform:   + resource "github_team" "all_in_one" {
20:52:12.353 STDOUT terraform:       + create_default_maintainer = false
20:52:12.353 STDOUT terraform:       + etag                      = (known after apply)
20:52:12.353 STDOUT terraform:       + id                        = (known after apply)
20:52:12.353 STDOUT terraform:       + members_count             = (known after apply)
20:52:12.354 STDOUT terraform:       + name                      = "team-3"
20:52:12.354 STDOUT terraform:       + node_id                   = (known after apply)
20:52:12.354 STDOUT terraform:       + parent_team_read_id       = (known after apply)
20:52:12.354 STDOUT terraform:       + parent_team_read_slug     = (known after apply)
20:52:12.354 STDOUT terraform:       + privacy                   = "closed"
20:52:12.354 STDOUT terraform:       + slug                      = (known after apply)
20:52:12.354 STDOUT terraform:     }
20:52:12.354 STDOUT terraform:   # github_team.all_in_one["team-4"] will be created
20:52:12.354 STDOUT terraform:   + resource "github_team" "all_in_one" {
20:52:12.354 STDOUT terraform:       + create_default_maintainer = false
20:52:12.354 STDOUT terraform:       + etag                      = (known after apply)
20:52:12.354 STDOUT terraform:       + id                        = (known after apply)
20:52:12.354 STDOUT terraform:       + members_count             = (known after apply)
20:52:12.354 STDOUT terraform:       + name                      = "team-4"
20:52:12.354 STDOUT terraform:       + node_id                   = (known after apply)
20:52:12.354 STDOUT terraform:       + parent_team_read_id       = (known after apply)
20:52:12.354 STDOUT terraform:       + parent_team_read_slug     = (known after apply)
20:52:12.354 STDOUT terraform:       + privacy                   = "closed"
20:52:12.354 STDOUT terraform:       + slug                      = (known after apply)
20:52:12.354 STDOUT terraform:     }
20:52:12.354 STDOUT terraform:   # github_team.all_in_one["team-5"] will be created
20:52:12.354 STDOUT terraform:   + resource "github_team" "all_in_one" {
20:52:12.354 STDOUT terraform:       + create_default_maintainer = false
20:52:12.354 STDOUT terraform:       + etag                      = (known after apply)
20:52:12.354 STDOUT terraform:       + id                        = (known after apply)
20:52:12.354 STDOUT terraform:       + members_count             = (known after apply)
20:52:12.354 STDOUT terraform:       + name                      = "team-5"
20:52:12.354 STDOUT terraform:       + node_id                   = (known after apply)
20:52:12.354 STDOUT terraform:       + parent_team_read_id       = (known after apply)
20:52:12.354 STDOUT terraform:       + parent_team_read_slug     = (known after apply)
20:52:12.354 STDOUT terraform:       + privacy                   = "closed"
20:52:12.354 STDOUT terraform:       + slug                      = (known after apply)
20:52:12.354 STDOUT terraform:     }
20:52:12.354 STDOUT terraform:   # github_team_membership.all_in_one["team-1"] will be created
20:52:12.354 STDOUT terraform:   + resource "github_team_membership" "all_in_one" {
20:52:12.354 STDOUT terraform:       + etag     = (known after apply)
20:52:12.354 STDOUT terraform:       + id       = (known after apply)
20:52:12.354 STDOUT terraform:       + role     = "maintainer"
20:52:12.354 STDOUT terraform:       + team_id  = "team-1"
20:52:12.354 STDOUT terraform:       + username = "Rindrics"
20:52:12.354 STDOUT terraform:     }
20:52:12.354 STDOUT terraform:   # github_team_membership.all_in_one["team-2"] will be created
20:52:12.354 STDOUT terraform:   + resource "github_team_membership" "all_in_one" {
20:52:12.354 STDOUT terraform:       + etag     = (known after apply)
20:52:12.354 STDOUT terraform:       + id       = (known after apply)
20:52:12.354 STDOUT terraform:       + role     = "maintainer"
20:52:12.354 STDOUT terraform:       + team_id  = "team-2"
20:52:12.354 STDOUT terraform:       + username = "Rindrics"
20:52:12.354 STDOUT terraform:     }
20:52:12.354 STDOUT terraform:   # github_team_membership.all_in_one["team-3"] will be created
20:52:12.354 STDOUT terraform:   + resource "github_team_membership" "all_in_one" {
20:52:12.354 STDOUT terraform:       + etag     = (known after apply)
20:52:12.354 STDOUT terraform:       + id       = (known after apply)
20:52:12.354 STDOUT terraform:       + role     = "maintainer"
20:52:12.354 STDOUT terraform:       + team_id  = "team-3"
20:52:12.354 STDOUT terraform:       + username = "Rindrics"
20:52:12.354 STDOUT terraform:     }
20:52:12.354 STDOUT terraform:   # github_team_membership.all_in_one["team-4"] will be created
20:52:12.354 STDOUT terraform:   + resource "github_team_membership" "all_in_one" {
20:52:12.354 STDOUT terraform:       + etag     = (known after apply)
20:52:12.355 STDOUT terraform:       + id       = (known after apply)
20:52:12.355 STDOUT terraform:       + role     = "maintainer"
20:52:12.355 STDOUT terraform:       + team_id  = "team-4"
20:52:12.355 STDOUT terraform:       + username = "Rindrics"
20:52:12.355 STDOUT terraform:     }
20:52:12.355 STDOUT terraform:   # github_team_membership.all_in_one["team-5"] will be created
20:52:12.355 STDOUT terraform:   + resource "github_team_membership" "all_in_one" {
20:52:12.355 STDOUT terraform:       + etag     = (known after apply)
20:52:12.355 STDOUT terraform:       + id       = (known after apply)
20:52:12.355 STDOUT terraform:       + role     = "maintainer"
20:52:12.355 STDOUT terraform:       + team_id  = "team-5"
20:52:12.355 STDOUT terraform:       + username = "Rindrics"
20:52:12.355 STDOUT terraform:     }
20:52:12.355 STDOUT terraform:   # github_team_repository.all_in_one["team-1:foo"] will be created
20:52:12.355 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
20:52:12.355 STDOUT terraform:       + etag       = (known after apply)
20:52:12.355 STDOUT terraform:       + id         = (known after apply)
20:52:12.355 STDOUT terraform:       + permission = "maintain"
20:52:12.355 STDOUT terraform:       + repository = "foo"
20:52:12.355 STDOUT terraform:       + team_id    = (known after apply)
20:52:12.355 STDOUT terraform:     }
20:52:12.355 STDOUT terraform:   # github_team_repository.all_in_one["team-2:baz"] will be created
20:52:12.355 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
20:52:12.355 STDOUT terraform:       + etag       = (known after apply)
20:52:12.355 STDOUT terraform:       + id         = (known after apply)
20:52:12.355 STDOUT terraform:       + permission = "maintain"
20:52:12.355 STDOUT terraform:       + repository = "baz"
20:52:12.355 STDOUT terraform:       + team_id    = (known after apply)
20:52:12.355 STDOUT terraform:     }
20:52:12.355 STDOUT terraform:   # github_team_repository.all_in_one["team-2:foo"] will be created
20:52:12.355 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
20:52:12.355 STDOUT terraform:       + etag       = (known after apply)
20:52:12.355 STDOUT terraform:       + id         = (known after apply)
20:52:12.355 STDOUT terraform:       + permission = "maintain"
20:52:12.355 STDOUT terraform:       + repository = "foo"
20:52:12.355 STDOUT terraform:       + team_id    = (known after apply)
20:52:12.355 STDOUT terraform:     }
20:52:12.355 STDOUT terraform:   # github_team_repository.all_in_one["team-3:bar"] will be created
20:52:12.355 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
20:52:12.355 STDOUT terraform:       + etag       = (known after apply)
20:52:12.355 STDOUT terraform:       + id         = (known after apply)
20:52:12.355 STDOUT terraform:       + permission = "maintain"
20:52:12.355 STDOUT terraform:       + repository = "bar"
20:52:12.355 STDOUT terraform:       + team_id    = (known after apply)
20:52:12.355 STDOUT terraform:     }
20:52:12.355 STDOUT terraform:   # github_team_repository.all_in_one["team-3:baz"] will be created
20:52:12.355 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
20:52:12.355 STDOUT terraform:       + etag       = (known after apply)
20:52:12.355 STDOUT terraform:       + id         = (known after apply)
20:52:12.355 STDOUT terraform:       + permission = "maintain"
20:52:12.355 STDOUT terraform:       + repository = "baz"
20:52:12.355 STDOUT terraform:       + team_id    = (known after apply)
20:52:12.355 STDOUT terraform:     }
20:52:12.355 STDOUT terraform:   # github_team_repository.all_in_one["team-3:foo"] will be created
20:52:12.355 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
20:52:12.355 STDOUT terraform:       + etag       = (known after apply)
20:52:12.355 STDOUT terraform:       + id         = (known after apply)
20:52:12.355 STDOUT terraform:       + permission = "maintain"
20:52:12.355 STDOUT terraform:       + repository = "foo"
20:52:12.355 STDOUT terraform:       + team_id    = (known after apply)
20:52:12.355 STDOUT terraform:     }
20:52:12.355 STDOUT terraform:   # github_team_repository.all_in_one["team-4:baz"] will be created
20:52:12.355 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
20:52:12.355 STDOUT terraform:       + etag       = (known after apply)
20:52:12.355 STDOUT terraform:       + id         = (known after apply)
20:52:12.355 STDOUT terraform:       + permission = "maintain"
20:52:12.355 STDOUT terraform:       + repository = "baz"
20:52:12.355 STDOUT terraform:       + team_id    = (known after apply)
20:52:12.355 STDOUT terraform:     }
20:52:12.355 STDOUT terraform:   # github_team_repository.all_in_one["team-5:bar"] will be created
20:52:12.355 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
20:52:12.355 STDOUT terraform:       + etag       = (known after apply)
20:52:12.355 STDOUT terraform:       + id         = (known after apply)
20:52:12.355 STDOUT terraform:       + permission = "maintain"
20:52:12.355 STDOUT terraform:       + repository = "bar"
20:52:12.356 STDOUT terraform:       + team_id    = (known after apply)
20:52:12.356 STDOUT terraform:     }
20:52:12.356 STDOUT terraform:   # github_team_repository.all_in_one["team-5:baz"] will be created
20:52:12.356 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
20:52:12.356 STDOUT terraform:       + etag       = (known after apply)
20:52:12.356 STDOUT terraform:       + id         = (known after apply)
20:52:12.356 STDOUT terraform:       + permission = "maintain"
20:52:12.356 STDOUT terraform:       + repository = "baz"
20:52:12.356 STDOUT terraform:       + team_id    = (known after apply)
20:52:12.356 STDOUT terraform:     }
20:52:12.356 STDOUT terraform:   # github_team_repository.all_in_one["team-5:foo"] will be created
20:52:12.356 STDOUT terraform:   + resource "github_team_repository" "all_in_one" {
20:52:12.356 STDOUT terraform:       + etag       = (known after apply)
20:52:12.356 STDOUT terraform:       + id         = (known after apply)
20:52:12.356 STDOUT terraform:       + permission = "maintain"
20:52:12.356 STDOUT terraform:       + repository = "foo"
20:52:12.356 STDOUT terraform:       + team_id    = (known after apply)
20:52:12.356 STDOUT terraform:     }
20:52:12.356 STDOUT terraform: Plan: 3 to import, 23 to add, 1 to change, 0 to destroy.
20:52:12.356 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
20:52:12.356 STDOUT terraform: Saved the plan to: .terraform/terraform.plan
20:52:12.356 STDOUT terraform: To perform exactly these actions, run the following command to apply:
20:52:12.356 STDOUT terraform:     terraform apply ".terraform/terraform.plan"
20:52:12.409 INFO   The stack at . will be processed in the following order for command apply:
Group 1
- Module .


Are you sure you want to run 'terragrunt apply' in each folder of the stack described above? (y/n) 20:52:12.409 ERROR  EOF
20:52:12.409 ERROR  Unable to determine underlying exit code, so Terragrunt will exit with error code 1
make: *** [Makefile:35: apply-force] Error 1

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform_apply","PRNumber":7,"Program":"tfcmt","SHA1":"a36ff5b8b93617eebfa3b798fe026f50a954c3f8","Vars":{},"WorkflowName":"terraform-apply"} -->